In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt

In [2]:
foo = pd.read_csv('Social_Network_Ads[1].csv')
foo.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
col=['User ID','Gender','Age','EstimatedSalary','Purchased']

In [4]:
foo = pd.read_csv('Social_Network_Ads[1].csv',names=col,header=1)

In [5]:
foo.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15810944    Male   35            20000          0
1  15668575  Female   26            43000          0
2  15603246  Female   27            57000          0
3  15804002    Male   19            76000          0
4  15728773    Male   27            58000          0

In [6]:
foo.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased
394  15691863  Female   46            41000          1
395  15706071    Male   51            23000          1
396  15654296  Female   50            20000          1
397  15755018    Male   36            33000          0
398  15594041  Female   49            36000          1

In [7]:
foo.count()

User ID            399
Gender             399
Age                399
EstimatedSalary    399
Purchased          399
dtype: int64

In [8]:
foo.describe()

            User ID         Age  EstimatedSalary   Purchased
count  3.990000e+02  399.000000       399.000000  399.000000
mean   1.569171e+07   37.701754     69869.674185    0.358396
std    7.166938e+04   10.454196     34044.650812    0.480131
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562787e+07   30.000000     43000.000000    0.000000
50%    1.569440e+07   37.000000     70000.000000    0.000000
75%    1.575039e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [9]:
feature = ['Age','EstimatedSalary',]

In [10]:
x = foo[feature]
y = foo.Purchased

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
x_train,x_test,y_train,y_test = train_test_split(x,y,random_state = 0)

In [13]:
from sklearn.linear_model import LogisticRegression

In [14]:
log_reg = LogisticRegression()
log_reg.fit(x_train,y_train)

LogisticRegression()

In [15]:
y_pred = log_reg.predict(x_test)

In [16]:
from sklearn.metrics import accuracy_score,confusion_matrix,recall_score

In [17]:
accuracy_score(y_test, y_pred)

0.7

In [18]:
y_test.value_counts()

0    70
1    30
Name: Purchased, dtype: int64

In [19]:
y_test.mean()

0.3

In [20]:
print("True Gender :      "),y_test.values[15:30]

True Gender :

(None, array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1], dtype=int64))

In [21]:
print("Predicted Gender : "),y_pred[15:30]

Predicted Gender :

(None, array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64))

In [22]:
confusion_matrix(y_test, y_pred)

array([[70,  0],
       [30,  0]], dtype=int64)

In [23]:
recall_score(y_test, y_pred)

0.0